{
    "intents": [
      {
        "tag": "greeting",
        "patterns": [
          "Hi",
          "Hey",
          "How are you",
          "Is anyone there?",
          "Hello",
          "Good day"
        ],
        "responses": [
          "Hey :-)",
          "Hello, thanks for visiting",
          "Hi there, what can I do for you?",
          "Hi there, how can I help?"
        ]
      },
      {
        "tag": "goodbye",
        "patterns": ["Bye", "See you later", "Goodbye"],
        "responses": [
          "See you later, thanks for visiting",
          "Have a nice day",
          "Bye! Come back again soon."
        ]
      },
      {
        "tag": "thanks",
        "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
        "responses": ["Happy to help!", "Any time!", "My pleasure"]
      },
      {
        "tag": "funny",
        "patterns": [
          "Tell me a joke!",
          "Tell me something funny!",
          "Do you know a joke?"
        ],
        "responses": [
          "Why did the hipster burn his mouth? He drank the coffee before it was cool.",
          "What did the buffalo say when his son left for college? Bison."
        ]
      },
      {
        "tag": "useform",
        "patterns": [
          "How to use the form?",
          "Help me with the form.",
          "How does the form work?"
        ],
        "responses": [
          "To use the form, you need to fill all the informations according to the data. Make sure they are in the appropriate format.You can get all this information on your e-business platform account."
        ]
      },
      {
        "tag": "appropriateformat",
        "patterns": [
          "What do you mean appropriate format?",
          "What is the appropriate format?",
          "What formats exist?"
        ],
        "responses": [
          "The formats are the following:\n- For the minimum, maximum, and mean, just put the corresponding values.\n- For the number of articles, it has to be an integer.\n- For the growth rate, please write 'like' in the example. For 12.5%, use '12.5'.\nPlease don't use any characters other than numbers."
        ]
      },
      {
        "tag": "apppurpose",
        "patterns": [
          "What is this app for?",
          "What is the purpose of this app?",
          "Why does this application exist?"
        ],
        "responses": [
          "The fraud detection app was created as a final year project from engineering school. Its purpose is to help small sellers to detect potential frauds over transactions."
        ]
      },
      {
        "tag": "keepdata",
        "patterns": [
          "Do you store any data?",
          "Do you keep my data?",
          "I don't want my data to be saved",
          "Is my data secured?"
        ],
        "responses": [
          "Your data isn't saved anywhere and stays completely confidential."
        ]
      },
      {
        "tag": "mistakes",
        "patterns": [
          "How reliable are you?",
          "Do you make mistakes?",
          "Can I trust you?",
          "Should I trust you?"
        ],
        "responses": [
          "Never trust an AI. I'm a tool to help you identify a potential fraud but I can make mistake. Be sure to double check by yourself."
        ]
      },
      {
        "tag": "help",
        "patterns": [
          "Help me.",
          "Can you help me?",
          "I need assistance!",
          "I need an information."
        ],
        "responses": [
          "Please type your request.",
          "I'll try my best to answer.",
          "How can I help you?",
          "Hope I can help, feel free to ask me a question about fraud and the app."
        ]
      },
      {
        "tag": "frauddefinition",
        "patterns": [
          "What is fraud?",
          "Explain what a fraud is.",
          "What do you mean by fraud?"
        ],
        "responses": [
          "Fraud is a deliberate deception or trickery carried out with the intent to gain an unfair or dishonest advantage, typically for financial gain. It involves the use of false information, misrepresentation, or deceit to manipulate individuals, organizations, or systems. Fraudulent activities can take various forms and occur in different contexts, including financial transactions, online interactions, identity theft, and more."
        ]
      },
      {
        "tag": "onlinefraud",
        "patterns": [
          "What is online fraud?",
          "What is the difference between fraud and online fraud?",
          "Explain what an online fraud is.",
          "What do you mean by online fraud?"
        ],
        "responses": [
          "Online fraud is a subgroup of frauds that occur through the web. It encompasses various deceptive activities, such as identity theft, stolen credit cards, and attempts to exploit vulnerabilities in online security systems."
        ]
      },
      {
        "tag": "onlinefraudtechnic",
        "patterns": [
          "How an online fraud works ?",
          "Which technique of online fraud could be use ? "
        ],
        "responses": [
          "Online fraud involves a range of illicit practices conducted in the digital realm. This can include fraudulent activities related to :\n 1) Postal addresses, where scammers may use fake addresses to deceive individuals or organizations.\n 2) Unauthorized use of stolen credit card information. Cybercriminals may gain access to credit card details through various means, leading to unauthorized transactions and financial losses for the victims.\n 3) In some cases of online fraud, individuals may attempt to circumvent security checks by purchasing cheaper products to pass through credit card security measures. This tactic is used to make fraudulent transactions appear legitimate, posing a challenge for fraud detection systems.\n\nTechnics of fraude are always elvolve continuously,we are trying our best to adapt our system to this environment"
        ]
      },
      {
        "tag": "certitude",
        "patterns": [
          "I am not sure about a transaction"
        ],
        "responses": [
          "Our app is a way to get information to assist you in your decision-making process. The best approach is to directly inquire via email or phone with the customer to confirm their authenticity as the origin of the purchase."
        ]
      },
      {
        "tag": "victim",
        "patterns": [
          "I am victim of a fraud"
        ],
        "responses": [
          "Please report the buyer informations in the buyer information tab in the application, to protect other seller. And report to the police"
        ]
      },
      {
        "tag": "stolencreditcardfraud",
        "patterns": [
          "Unauthorized credit card transaction",
          "Report stolen credit card",
          "Credit card fraud alert",
          "What to do if my credit card is stolen?"
        ],
        "responses": [
          "Stolen credit card fraud involves unauthorized use of credit card information for fraudulent transactions. If you suspect such activity, dont accept the transaction and report the buyer informations in the buyer information tab in the application, to protect other seller."
        ]
      },
      {
        "tag": "addressfraud",
        "patterns": [
          "Fake address in online purchase",
          "Address verification scam",
          "How to spot address fraud",
          "Address manipulation in online transactions"
        ],
        "responses": [
          "Address fraud involves the use of fake or manipulated addresses in online transactions. Be cautious when dealing with orders that seem to use questionable addresses, and report any suspicious activity to the appropriate authorities.",
          "Scammers may employ address fraud to deceive individuals or organizations. Stay alert to unusual address patterns in online purchases, and report any concerns to the relevant parties for investigation.",
          "Address verification scams can be a form of fraud. If you suspect address fraud in online transactions, take steps to verify the legitimacy of the information and report any discrepancies to prevent potential fraud."
        ]
      },
      {
        "tag": "refundbeforereturnfraud",
        "patterns": [
          "Requesting refund before returning product",
          "Refund scam warning",
          "How to identify refund fraud",
          "Online purchase refund policy"
        ],
        "responses": [
          "Refund before returning product can be a fraudulent tactic. Exercise caution when someone requests a refund before the product is returned. Verify the legitimacy of the request and follow the established refund policies.",
          "Be aware of refund scams where individuals request a refund before returning the purchased item. It's essential to adhere to the standard refund procedures and report any suspicious requests to prevent fraud.",
          "Fraudsters may attempt to exploit refund processes by requesting a refund before returning the product. Familiarize yourself with the online purchase refund policy and be cautious of any deviations from standard procedures."
        ]
      },
      {
        "tag": "unusualpurchasefraud",
        "patterns": [
          "Unusual purchase amount",
          "Unexpected quantity in shopping basket",
          "Identify fraud with unusual purchase",
          "Unusual order total"
        ],
        "responses": [
          "Unusual purchase fraud may involve atypical order amounts or quantities in the shopping basket. Stay vigilant and review orders that seem out of the ordinary to prevent potential fraudulent transactions, and use our AI to check the basket.",
          "If you notice unexpected quantities or unusually high/low purchase amounts in the shopping basket, it could be a sign of fraud. Investigate with the help of our IA to detect potential fraud, such orders thoroughly and take necessary precautions to ensure the legitimacy of the transaction.",
          "Fraudsters may manipulate order quantities or amounts to carry out online fraud. Be proactive in identifying and flagging any unusual purchases, and implement additional verification steps to safeguard against fraudulent activities with our IA to detect potential fraud.",
          "An unexpected total in the shopping basket may indicate fraudulent activity. Check the transaction with our AI."
        ]
      },
      {
        "tag": "Databreach",
        "patterns": [
          "What is a data breach ?"
        ],
        "responses": [
          "A data breach occurs when cybercriminals hack into organizations databases and steal sensitive information. The data, which is exposed to the public, can include, passwords, account numbers, correspondence, names, home addresses, Social Security numbers and more."
        ]
      }

    ]
  }