{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there",
        "Hello",
        "Good day",
        "Good morning",
        "Good evening",
        "What's up?"
      ],
      "responses": [
        "Hey :-)",
        "Hello, thanks for visiting",
        "Hi there, what can I do for you",
        "Hi there, how can I help"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Bye",
        "See you later",
        "Goodbye",
        "Catch you later",
        "I'm off",
        "Talk to you later"
      ],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "Thanks",
        "Thank you",
        "That's helpful",
        "Thank's a lot!",
        "Appreciate it",
        "Thanks for the help"
      ],
      "responses": [
        "Happy to help!",
        "Any time!",
        "My pleasure"
      ]
    },
    {
      "tag": "funny",
      "patterns": [
        "Tell me a joke!",
        "Tell me something funny!",
        "Do you know a joke",
        "Make me laugh",
        "Got any good jokes?"
      ],
      "responses": [
        "Why did the hipster burn his mouth? He drank the coffee before it was cool.",
        "What did the buffalo say when his son left for college? Bison."
      ]
    },
    {
      "tag": "useform",
      "patterns": [
        "How to use the form",
        "Help me with the form.",
        "How does the form work"
      ],
      "responses": [
        "To use the form, you need to fill all the informations according to the data. Make sure they are in the appropriate format. You can get all this information on your e-business platform account."
      ]
    },
    {
      "tag": "appropriateformat",
      "patterns": [
        "What do you mean appropriate format",
        "What is the appropriate format",
        "What formats exist",
        "Explain the formats",
        "How does the formats work"
      ],
      "responses": [
        "The formats are the following: For the minimum, maximum, and mean, just put the corresponding values. For the number of articles, it has to be an integer. For the growth rate, please write 'like' in the example. For 12.5%, use '12.5'. Please don't use any characters other than numbers."
      ]
    },
    {
      "tag": "apppurpose",
      "patterns": [
        "What is this app for",
        "What is the purpose of this app",
        "Why does this application exist"
      ],
      "responses": [
        "The fraud detection app was created as a final year project from engineering school. Its purpose is to help small sellers to detect potential frauds over transactions."
      ]
    },
    {
      "tag": "apphelp",
      "patterns": [
        "How do I use the app",
        "How can I use the application",
        "Can you help me with the app",
        "Please tell me how to use the application"
      ],
      "responses": [
        "I can explain how the profile and fraud detector work together, or how you can use the tools in services."
      ]
    },
    {
      "tag": "profilehelp",
      "patterns": [
        "How do I fill the profile",
        "What is the purpose of the profile",
        "Do I need to complete the profile",
        "Can you explain the profile"
      ],
      "responses": [
        "The profile is necessary to build an AI able to detect frauds for your market. You have to fill all the informations. Click on the (i) icon over each field to get more informations about what to enter."
      ]
    },
    {
      "tag": "frauddetectorhelp",
      "patterns": [
        "What does the fraud detector do",
        "How do I use the fraud detector",
        "What is the purpose of the fraud detector",
        "Can you tell me fraud detector"
      ],
      "responses": [
        "After completing your profile, you can use the fraud detector to check if one of your market's transaction was a fraud. You only have 4 fields to fill, and you can get more information on them by clicking on the icon over each field."
      ]
    },
    {
      "tag": "servicehelp",
      "patterns": [
        "What are the services",
        "I don't understand the services",
        "What about the services",
        "How do I use the services",
        "Can you explain the services"
      ],
      "responses": [
        "You can use the services to report a buyer, or to check how many times he was reported. You can also use the email checker to know if an email was listed on a website recently victim of data leak."
      ]
    },
    {
      "tag": "emailchecker",
      "patterns": [
        "How do I use the emailchecker",
        "What is the email checker used for",
        "Can you explain the email check"
      ],
      "responses": [
        "Enter any email and we'll check if it was on a website victim of data leak. This can take a little time."
      ]
    },
    {
      "tag": "keepdata",
      "patterns": [
        "Do you store any data",
        "Do you keep my data",
        "I don't want my data to be saved",
        "Is my data secured"
      ],
      "responses": [
        "Your data isn't saved anywhere and stays completely confidential."
      ]
    },
    {
      "tag": "mistakes",
      "patterns": [
        "How reliable are you",
        "Do you make mistakes",
        "Can I trust you",
        "Should I trust you"
      ],
      "responses": [
        "Never trust an AI. I'm a tool to help you identify a potential fraud but I can make mistake. Be sure to double check by yourself."
      ]
    },
    {
      "tag": "help",
      "patterns": [
        "Help me.",
        "Can you help me",
        "I need assistance!",
        "I need an information."
      ],
      "responses": [
        "Please type your request.",
        "I'll try my best to answer.",
        "How can I help you",
        "Hope I can help, feel free to ask me a question about fraud and the app."
      ]
    },
    {
      "tag": "frauddefinition",
      "patterns": [
        "What is fraud",
        "Explain what a fraud is.",
        "What do you mean by fraud",
        "What do you know about frauds"
      ],
      "responses": [
        "Fraud is a deliberate deception or trickery carried out with the intent to gain an unfair or dishonest advantage, typically for financial gain. It involves the use of false information, misrepresentation, or deceit to manipulate individuals, organizations, or systems. Fraudulent activities can take various forms and occur in different contexts, including financial transactions, online interactions, identity theft, and more."
      ]
    },
    {
      "tag": "onlinefraud",
      "patterns": [
        "What is online fraud",
        "What is the difference between fraud and online fraud",
        "Explain what an online fraud is.",
        "What do you mean by online fraud",
        "What do you know about online frauds"
      ],
      "responses": [
        "Online fraud is a subgroup of frauds that occur through the web. It encompasses various deceptive activities, such as identity theft, stolen credit cards, and attempts to exploit vulnerabilities in online security systems."
      ]
    },
    {
      "tag": "onlinefraudtechnic",
      "patterns": [
        "How an online fraud works",
        "Which technique of online fraud could be use"
      ],
      "responses": [
        "Online fraud involves a range of illicit practices conducted in the digital realm. This can include fraudulent activities related to postal addresses, unauthorized use of stolen credit card information, and attempts to circumvent security checks by purchasing cheaper products to pass through credit card security measures. Techniques of fraud evolve continuously, and we are trying our best to adapt our system to this environment."
      ]
    },
    {
      "tag": "certitude",
      "patterns": [
        "I am not sure about a transaction"
      ],
      "responses": [
        "Our app is a way to get information to assist you in your decision-making process. The best approach is to directly inquire via email or phone with the customer to confirm their authenticity as the origin of the purchase."
      ]
    },
    {
      "tag": "victim",
      "patterns": [
        "I am victim of a fraud"
      ],
      "responses": [
        "Please report the buyer information in the buyer information tab in the application, to protect other sellers. And report to the police."
      ]
    },
    {
      "tag": "fraud_detection_explanation",
      "patterns": [
        "How does the fraud detection work?",
        "What is an autoencoder?",
        "How do you detect unusual transactions?",
        "Explain the fraud detection process",
        "How is fraud identified in transactions?"
      ],
      "responses": [
        "Our fraud detection app uses an autoencoder algorithm that learns to encode transactions based on their features, such as item prices and quantities. It then decodes this information to detect anomalies from the normal transaction pattern, flagging potential fraud.",
        "The autoencoder helps in identifying transactions that significantly deviate from the typical patterns, using factors like unusual item quantities or price totals beyond normal thresholds."
      ]
    },
    {
      "tag": "fraud_alert_handling",
      "patterns": [
        "What happens when a fraud is detected?",
        "How will I be notified of a possible fraud?",
        "What should I do if my transaction is flagged as fraud?",
        "Fraud detection protocol",
        "Actions after fraud detection"
      ],
      "responses": [
        "When you enter the parameters of the transaction you want to check through our app, the system will tell you whether or not the transaction is a potential fraud. It is then up to you to take action. You can then check whether the person that made the transaction has already been reported by another user, or even report them yourself."
      ]
    },
    {
      "tag": "user_role_in_fraud_detection",
      "patterns": [
        "Can I help improve fraud detection?",
        "What can I do to make the app more accurate?",
        "How does user feedback affect fraud detection?",
        "Improving fraud detection system",
        "Contribute to fraud detection accuracy"
      ],
      "responses": [
        "User feedback is crucial for improving our fraud detection accuracy. By reporting false positives or unnoticed fraudulent transactions, you help us refine our detection algorithms.",
        "Your input on flagged transactions helps our system learn and adjust, making it more efficient over time. We encourage users to review and provide feedback on alerts."
      ]
    },
    {
      "tag": "fraud_detection_data_security",
      "patterns": [
        "Is my data safe?",
        "How do you protect my privacy while detecting fraud?",
        "What data security measures are in place?",
        "Data privacy in fraud detection",
        "Security protocols for data protection"
      ],
      "responses": [
        "We prioritize your privacy and data security. None of your data is stored on our servers, ensuring that data breaches won't be an issue."
      ]
    },
    {
      "tag": "updating_fraud_detection_models",
      "patterns": [
        "How often do you update the fraud detection system?",
        "Do you regularly improve the fraud detection algorithms?",
        "What's the process for updating your fraud detection capabilities?",
        "Fraud detection system updates",
        "Improving and updating fraud algorithms"
      ],
      "responses": [
        "Our fraud detection models are continuously updated to adapt to new fraud trends and patterns. We integrate user feedback and the latest in AI research to enhance accuracy.",
        "The update process involves analyzing transaction data, user feedback, and emerging fraud tactics to refine our algorithms. This ensures our system remains effective against the latest fraud techniques."
      ]
    },
    {
      "tag": "how_to_use_app",
      "patterns": [
        "How can I use the app?",
        "What are the steps to start using the app?",
        "Is it difficult to set up the fraud detection app?",
        "Guide to app usage",
        "Instructions for using the app"
      ],
      "responses": [
        "Using the app is simple! You need to start by entering some information about your e-commerce. Then, our app will create an algorithm and fit it according to the information that you previously gave us. You are then ready to start. Enter any transaction details you want to check for fraud directly in the app.",
        "Our app is designed to be user-friendly. After entering the information that we need to fit our algorithm, you'll be guided through the process of entering your product and transaction information. It's quick and easy!"
      ]
    },
    {
      "tag": "app_usefulness",
      "patterns": [
        "How is this app useful for me?",
        "What benefits does the fraud detection app offer?",
        "Why should I use this fraud detection app?",
        "Advantages of using the app",
        "How can the app benefit my business?"
      ],
      "responses": [
        "Our app helps protect your business from fraudulent transactions by analyzing purchase patterns and flagging any that seem unusual. This can save you money and maintain your reputation among customers.",
        "By using our fraud detection app, you gain peace of mind knowing that your transactions are being monitored for any potential fraud. It's an essential tool for any business operating online."
      ]
   
    },
    {
      "tag": "signing_up",
      "patterns": [
        "How do I sign up for the app?",
        "What information is needed to register?",
        "Can I start using the app right after signing up?",
        "Creating an account on the app",
        "Registration process for the app"
      ],
      "responses": [
        "There is no signing up! Our app can be used right away!"
      ]
    },
    {
      "tag": "transaction_check",
      "patterns": [
        "How do I check a transaction for fraud?",
        "What details do I need to provide to analyze a transaction?",
        "Is checking a transaction complicated?",
        "Analyzing transactions for fraud",
        "Process for reviewing transactions"
      ],
      "responses": [
        "To check a transaction, simply enter its details into the app, including the price and quantity of items. Our system will analyze it based on the thresholds you've set and alert you if anything looks suspicious.",
        "Checking a transaction is straightforward. You'll need to input the transaction's total price, item quantities, and any other relevant details you have. Our app takes care of the rest."
      ]
    },
    {
      "tag": "non_tech_friendly",
      "patterns": [
        "I'm not tech-savvy. Will I be able to use this app?",
        "Is the app designed for someone without a technical background?",
        "How user-friendly is the app for non-technical people?",
        "Ease of use for non-tech users",
        "App accessibility for beginners"
      ],
      "responses": [
        "Absolutely! Our app is designed to be accessible for everyone, regardless of their technical background. We've focused on making the interface intuitive, and you'll be guided through each step.",
        "You don't need to be tech-savvy to use our app. It's built with a straightforward, easy-to-navigate interface, ensuring that you can manage your fraud detection efforts without any hassle."
      ]
    },
    {
      "tag": "cost_of_app",
      "patterns": [
        "How much does the app cost?",
        "Is there a subscription fee for the fraud detection app?",
        "Are there any charges for using the app?",
        "App pricing details",
        "Subscription costs for the app"
      ],
      "responses": [
        "Our app is and will always be free of charge, as we believe that your safety should be accessible and free!"
      ]
    },
    {
      "tag": "compatibility",
      "patterns": [
        "Is the app compatible with my device?",
        "Can I use the app on both iOS and Android devices?",
        "What platforms does the fraud detection app support?",
        "Device compatibility for the app",
        "Supported platforms and devices"
      ],
      "responses": [
        "Our app is available on Android platforms, with iOS compatibility coming later this year.",
        "We've designed the app to work seamlessly across multiple platforms, including web browsers, for maximum accessibility."
      ]
    },
    {
      "tag": "privacy_concerns",
      "patterns": [
        "How do you ensure my data's privacy?",
        "What measures are in place to protect personal information?",
        "Can I trust the app with sensitive transaction data?",
        "Privacy policy for user data",
        "Protecting personal information in the app"
      ],
      "responses": [
        "Data privacy is our top priority. We don't store any of your information on our servers, so that your information remains private."
      ]
    },
    {
      "tag": "accuracy_of_fraud_detection",
      "patterns": [
        "How accurate is the fraud detection?",
        "Do false positives occur often in the app?",
        "Can I rely on the app's fraud detection algorithms?",
        "Reliability of fraud detection",
        "Accuracy and effectiveness of fraud alerts"
      ],
      "responses": [
        "Our fraud detection algorithms are highly accurate, utilizing the latest AI technologies. While no system is perfect, we constantly work to minimize false positives and negatives.",
        "You can trust our app to provide reliable fraud detection. We continuously update our algorithms based on new data and user feedback to enhance accuracy."
      ]
    },
    {
      "tag": "learning_from_mistakes",
      "patterns": [
        "Does the app learn from its mistakes?",
        "How does the app improve over time?",
        "Will the fraud detection get better with more use?",
        "Machine learning in fraud detection",
        "Continuous improvement of the app"
      ],
      "responses": [
        "Absolutely! Our app uses machine learning to adapt and improve from every transaction it analyzes, including any mistakes, ensuring better accuracy over time.",
        "Yes, the more you use the app, the smarter it gets. Our algorithms adjust based on feedback and new patterns, continually enhancing our fraud detection capabilities."
      ]
    },
    {
      "tag": "reporting_fraud",
      "patterns": [
        "How do I report a fraudulent transaction?",
        "What steps should I take if I detect fraud?",
        "Is there a way to report suspicious activity through the app?",
        "Reporting fraud in the app",
        "Action steps for suspected fraud"
      ],
      "responses": [
        "If you suspect a fraudulent transaction, you can report it directly through the app.",
        "Reporting suspicious activity is straightforward. Use the 'Report Fraud' feature in the app to report any suspicious individual."
      ]
    },
    {
      "tag": "stolencreditcardfraud",
      "patterns": [
        "Unauthorized credit card transaction",
        "Report stolen credit card",
        "Credit card fraud alert",
        "What to do if my credit card is stolen"
      ],
      "responses": [
        "Stolen credit card fraud involves unauthorized use of credit card information for fraudulent transactions. If you suspect such activity, don't accept the transaction and report the buyer information in the buyer information tab in the application, to protect other sellers."
      ]
    },
    {
      "tag": "addressfraud",
      "patterns": [
        "Fake address in online purchase",
        "Address verification scam",
        "How to spot address fraud",
        "Address manipulation in online transactions"
      ],
      "responses": [
        "Address fraud involves the use of fake or manipulated addresses in online transactions. Be cautious when dealing with orders that seem to use questionable addresses, and report any suspicious activity to the appropriate authorities.",
        "Scammers may employ address fraud to deceive individuals or organizations. Stay alert to unusual address patterns in online purchases, and report any concerns to the relevant parties for investigation.",
        "Address verification scams can be a form of fraud. If you suspect address fraud in online transactions, take steps to verify the legitimacy of the information and report any discrepancies to prevent potential fraud."
      ]
    },
    {
      "tag": "refundbeforereturnfraud",
      "patterns": [
        "Requesting refund before returning product",
        "Refund scam warning",
        "How to identify refund fraud",
        "Online purchase refund policy abuse"
      ],
      "responses": [
        "Refund before returning product can be a fraudulent tactic. Exercise caution when someone requests a refund before the product is returned. Verify the legitimacy of the request and follow the established refund policies.",
        "Be aware of refund scams where individuals request a refund before returning the purchased item. It's essential to adhere to the standard refund procedures and report any suspicious requests to prevent fraud.",
        "Fraudsters may attempt to exploit refund processes by requesting a refund before returning the product. Familiarize yourself with the online purchase refund policy and be cautious of any deviations from standard procedures."
      ]
    },
    {
      "tag": "unusualpurchasefraud",
      "patterns": [
        "Unusual purchase amount",
        "Unexpected quantity in shopping basket",
        "Identify fraud with unusual purchase",
        "Unusual order total"
      ],
      "responses": [
        "Unusual purchase fraud may involve atypical order amounts or quantities in the shopping basket. Stay vigilant and review orders that seem out of the ordinary to prevent potential fraudulent transactions.",
        "If you notice unexpected quantities or unusually high/low purchase amounts in the shopping basket, it could be a sign of fraud. Investigate such orders thoroughly and take necessary precautions to ensure the legitimacy of the transaction.",
        "Fraudsters may manipulate order quantities or amounts to carry out online fraud. Be proactive in identifying and flagging any unusual purchases and implement additional verification steps to safeguard against fraudulent activities."
      ]
    },
    {
      "tag": "Databreach",
      "patterns": [
        "What is a data breach",
        "How can a data breach occur",
        "When does a data breach happen",
        "Tell me about data breaches"
      ],
      "responses": [
        "A data breach occurs when cybercriminals hack into organizations' databases and steal sensitive information. The data, which can be exposed to the public, may include passwords, account numbers, correspondence, names, home addresses, Social Security numbers, and more."
      ]
    }
  ]
}

       
